{
    "perguntas": [
      "Oi",
      "Olá",
      "Iae",
      "iai",
      "Quais tipos de imoveis vocês oferecem?",
      "voces tem casas?",
      "Voces tem apartamentos?",
      "consigo imoveis comerciais",
      "Qual é a documentação necessária para alugar um imovel?",
      "documentos para compra",
      "documentos para aluguel",
      "Vocês têm opções de financiamento?",
      "Quais sao os custos envolvidos na compra de um imovel?",
      "custos extras de compra",
      "Qual e o prazo para aprovação do financiamento imobiliário?",
      "Quais sao as garantias exigidas para aluguel?",
      "O que e preciso para ser fiador?",
      "Qual é o horário de atendimento?",
      "O imovel ja vem mobiliado?",
      "O imovel e porteira fechada?",
      "Quais são os custos para alugar um imóvel?",
      "Posso negociar o valor do aluguel ou da compra?",
      "Posso alugar um imóvel sem fiador?",
      "e possível trocar um imovel por outro?",
      "voces aceitam troca?",
      "Vocas ajudam com a mudança?",
      "fazem a mudanca?",
      "Quais são as formas de pagamento aceitas?",
      "formas de pagamento",
      "Vocês trabalham com imóveis em leilão?",
      "Posso comprar um imóvel em construção?",
      "Apartamento na planta",
      "imovel na planta",
      "Como funciona o consórcio imobiliário?",
      "Posso morar em um imóvel antes da assinatura do contrato?",
      "Posso morar antes de assinar",
      "tudo bem?",
      "voce esta bem?",
      "como voce esta?",
      "Voce pode me dizer precos?",
      "quero alugar",
      "quero fazer um aluguel",
      "Onde tem imoveis",
      "em qual local voces atuam?",
      "que localidade posso alugar?",
      "que local posso comprar?",
      "recife olinda são paulo rio de janeiro amapá rondonia roraima bahia santa catarina petropolis santa teresa ouro preto brasilia paulista janga jaboatao joaopessoa maceio alagoas natal",
      "Falar com corretor humano",
      "falar com humano",
      "atendimento humano",
      "falar com atendente"
    ],
    "respostas": [
    "Olá, sou o Corretor Bot da Corretora Nassau! Estou aqui para ajudá-lo com qualquer dúvida sobre nossos imóveis e serviços. Como posso te ajudar hoje?",
    "Atualmente, trabalhamos com uma variedade de imóveis, incluindo apartamentos, casas, terrenos, imóveis comerciais e rurais. Consulte nosso site ou entre em contato para mais detalhes sobre as opções disponíveis.",
    "Os documentos normalmente exigidos para alugar um imóvel incluem RG, CPF, comprovante de renda atualizado e comprovante de residência. Dependendo do contrato, documentos adicionais podem ser solicitados.",
    "Sim, oferecemos diversas opções de financiamento em parceria com bancos renomados. Entre em contato com nossa equipe para mais detalhes sobre taxas, prazos e condições.",
    "Além do valor do imóvel, é importante considerar custos extras, como escritura, registro em cartório, ITBI (Imposto sobre Transmissão de Bens Imóveis) e taxas bancárias, se houver financiamento.",
    "O prazo para aprovação de financiamento imobiliário pode variar, geralmente entre 15 e 30 dias, dependendo do banco e da agilidade no envio da documentação necessária.",
    "Para alugar um imóvel, aceitamos garantias como seguro-fiança, caução ou fiador. A escolha depende das condições do contrato e da análise da documentação.",
    "Um fiador deve comprovar renda compatível com o valor do aluguel e possuir um imóvel quitado em seu nome como garantia. Consulte nossa equipe para mais informações.",
    "Nosso horário de atendimento é de segunda a sexta, das 9h às 18h, e aos sábados, das 9h às 13h. Estamos à disposição para esclarecer dúvidas e oferecer suporte.",
    "Alguns imóveis vêm mobiliados, mas essa condição varia. Verifique a descrição do imóvel de interesse ou consulte nossa equipe para confirmar.",
    "Os custos para alugar um imóvel podem incluir aluguel, condomínio, IPTU e, em alguns casos, seguro-fiança ou caução. Consulte nossa equipe para mais informações.",
    "Sim, nossa equipe está preparada para intermediar negociações, tanto para aluguel quanto para compra. Fale conosco para buscar as melhores condições.",
    "Sim, existem alternativas para alugar sem fiador, como seguro-fiança ou caução. Fale com nossa equipe para saber qual a melhor opção para você.",
    "Sim, trabalhamos com permutas e trocas de imóveis, dependendo das condições acordadas entre as partes. Consulte-nos para verificar as opções disponíveis.",
    "Embora não ofereçamos serviços de mudança diretamente, temos parceiros que podem ajudá-lo nesse processo. Consulte-nos para recomendações.",
    "Aceitamos diversas formas de pagamento: à vista, financiamento bancário e, em alguns casos, consórcios. Para aluguéis, aceitamos boleto e Pix, conforme as condições do contrato.",
    "Embora não lidemos diretamente com imóveis de leilão, podemos orientá-lo sobre como participar de leilões e aproveitar boas oportunidades.",
    "Sim, temos imóveis em construção e apartamentos na planta. Consulte-nos para conhecer as opções disponíveis e as condições especiais.",
    "O consórcio imobiliário funciona como uma poupança coletiva, onde os participantes contribuem mensalmente e são contemplados por sorteio ou lance. Fale conosco para mais detalhes.",
    "Não é permitido mudar para um imóvel antes da assinatura do contrato e da finalização dos trâmites legais. Essa medida é para sua segurança e a do proprietário.",
    "Estou bem, obrigado por perguntar! Espero que você também esteja e que eu possa ajudá-lo da melhor forma possível.",
    "Os preços de aluguel e compra variam de acordo com o imóvel e sua localização. Recomendo que você visite nosso site para verificar as opções disponíveis na sua região.",
    "Caso esteja interessado em alugar ou comprar, veja os imóveis disponíveis no nosso site. Para dúvidas sobre documentação ou pagamento, estou aqui para ajudar.",
    "Atendemos nas principais cidades do Brasil. Visite nosso site para ver os imóveis disponíveis na sua região e as condições específicas de cada localidade.",
    "Para falar com um corretor humano, ligue para o número na aba 'Fale Conosco' em nosso site ou envie um e-mail para 'supercorretora@corretoranassau.com.br'. Nossa equipe está pronta para atendê-lo!"
  ],
  "mapeamento": [0, 0, 0, 0, 1, 1, 1, 1, 
                  2, 2, 2, 3, 4, 4, 5, 6,
                  7, 8, 9, 10, 10, 11, 12,
                  13, 13, 14, 14, 15, 15,
                  16, 17, 17, 17, 18, 19,
                  19, 20, 20, 20, 21, 22,
                  22, 23, 23, 23, 23, 23,
                  24, 24, 24, 24]
  }
  